import Item1 from '../../../images/catalog/1.png'
import Item2 from '../../../images/catalog/2.png'
import Item3 from '../../../images/catalog/3.png'
import Item4 from '../../../images/catalog/4.png'
import Item5 from '../../../images/catalog/5.png'
import Item6 from '../../../images/catalog/6.png'
import Item7 from '../../../images/catalog/7.png'

export const ArrayContentTypeMeditation = [
    {
        imgSrc: Item2,
        nameItem: 'МЕДИТАЦИЯ ИЗОБИЛИЯ',
        nameItemSub:
            'Рунческая программа на поток клиентов «Магнетизм»',
        coast: '777',
        description: [
            `•Направляет к вам поток людей, которые ищут специалиста, как вы`,
            `•Разрушает все препятствия на пути клиентов к вам`,
            `•Убирает конкуренцию. Клиент просто не замечает другие услуги`,
            `•Создаются все условия, чтобы выбрали именно вас. В разы усиливается ваш магнетизм и людей необъяснимо тянет`,
            `•Люди выбирают именно вас среди конкурентов, вы яркие как солнце, заметные и привлекательные, что глаз не оторвать`,
            `•Даёт достойную оплату ваших услуг. Если у вас цены/зп ниже, чем вы достойны - в жизнь начинают приходить премии/доплаты`,
            `•Направляет к вам подарки судьбы и просто подарки`,
            `•Увеличивает поток клиентов в ваши проекты/ торговую точку`,
        ],
        linkPay: 'https://payform.ru/ec8lia/',
    },
    {
        imgSrc: Item5,
        nameItem: 'Чистка финансовых блоков',
        nameItemSub:
            'Руническая программа «Динамит»: на чистку внутренних финансовых блоков и негативных установок, мешающих обретению богатства',
        coast: '777',
        description: [
            `•Работает , как молот, который разбивает все блоки, комплексы, страхи, установки, связанные с деньгами`,
            `•Вы начинаете , на уровне чувств, ощущать, что достойны денег и Изобилия`,
            `•Очищает наши негативные мысли на тему денег и того, насколько мы достойны богатства и Изобилия`,
            `•Вычищает страхи, связанные с деньгами из нашего подсознания`,
            `•Улучшает все ассоциации, связанные с деньгами (например установка «богатые - жадные и злые» тормозит нас от того, чтобы быть богатым, а этот рунический став поможет начать смотреть на мир иначе)`,
            `•Напитывает нас энергией, чтобы принять трансформации`,
            `•Дает ощущение радости от жизни, чтобы все было во благо и все изменение приносили удовольствие`,
        ],
        linkPay: 'https://payform.ru/ef8lid/',
    },
    {
        imgSrc: Item6,
        nameItem: 'Переход на новый уровень жизни',
        nameItemSub:
            'Руническая программа для перехода на новый уровень жизни',
        coast: '0',
        description: [
            `•Дает ускорение процессов вашей трансформации и улучшение восприятия информации. «Золотой ключик», который отворяет двери мудрости и процветания`,
            `•Вы понимаете себя, чувствуете себя и осознаете , чего хотите и что вами происходит и как улучшить свою жизнь`,
            `•Дает степенность, умение усидеть на одном месте, основательность при восприятии информации`,
            `•Делает ваш мозг восприимчивым и открытым к новой информации. Создает крепкий фундамент на который ляжет все остальное. Из этого выстроится красивый новый дом нашей личности`,
            `•Дает усидчивость, умение делать дела и погружаться в процесс, умение потрудиться, улучшает мозговую деятельность.`,
            `•Умение видеть процесс целиком от «а» до «я» и работать не пропуская этапов , не бросая идти к цели на полпути и не прыгая с дела на дело`,
            `•Информация, которая в чистом виде будет проникать в сознание и лучше усваиваться, без искажений`,
        ],
        linkPay:
            'https://github.com/astrologdemidova/landing/raw/main/runafile22/6JgodgfF/Ускорение%20трансформаций.pdf',
    },
    {
        imgSrc: Item7,
        nameItem: 'Очищение финансового потока',
        nameItemSub:
            'Руническая программа на чистку финансового канала «Ёршик»',
        coast: '0',
        description: [
            `•Направляет к вам поток людей, которые ищут специалиста, как вы`,
            `•Разрушает все препятствия на пути клиентов к вам`,
            `•Убирает конкуренцию. Клиент просто не замечает другие услуги`,
            `•Создаются все условия, чтобы выбрали именно вас. В разы усиливается ваш магнетизм и людей необъяснимо тянет`,
            `•Люди выбирают именно вас среди конкурентов, вы яркие как солнце, заметные и привлекательные, что глаз не оторвать`,
            `•Даёт достойную оплату ваших услуг. Если у вас цены/зп ниже, чем вы достойны - в жизнь начинают приходить премии/доплаты`,
            `•Направляет к вам подарки судьбы и просто подарки`,
            `•Увеличивает поток клиентов в ваши проекты/ торговую точку`,
        ],
        linkPay:
            'https://github.com/astrologdemidova/landing/raw/main/runafile22/7Hufsido/Чистка%20фин%20канала%20.pdf',
    },
]