// import Item1 from '../../../images/catalog/1.png'

export const ArrayContentTypeMeditation = [
    {
        imgSrc: null,
        nameItem: 'МЕДИТАЦИЯ ИЗОБИЛИЯ',
        nameItemSub:
            'Ловите мою легендарную медитацию Изобилия! Когда я делала её на протяжении 28 дней - я подняла свой уровень дохода в 2 раза!',
        coast: '1 555',
        description: [
            `Но... я ее обновила и усовершенствовала для этого марафона. Там супер-звук и полное погружение✨`,
            `*Мои медитации не про духовность. Это целенаправленная работа с подсознанием. Медитация Изобилия плавно , но очень мощно искоренит из вашего сознания мысли о себе «я не достоин больших денег»/«большие деньги легко не зарабатываются» и тд`,
            `Не удивляйтесь, если во время неё вы будете плакать от счастья - так происходит очень часто, когда вы начинаете ощущать чего достойны НА САМОМ ДЕЛЕ`,
            `Не удивляйтесь, если каждый раз после прослушивания вам будут приходить неожиданные деньги/подарки/премии или увеличится поток клиентов.`,
            `Это все воздействие медитации на ваше подсознание`,
            `❓Почему её необходимо делать каждый день на протяжении минимум месяца?`,
            `Потому что эта медитация состоит из позитивных установок. В нашей голове очень много ненужных мыслей о себе: "Я - не смелый, не харизматичный, не достойный" и т.д. В этой медитации установки, обратные этим убеждениям. Когда вы постоянно слушаете похвалу от других людей, как бы вы сильно были не уверены в себе, вы начинаете больше верить в себя и любить себя. Эта медитация будет работать точно также. Весь негатив в вашей голове сменится позитивными убеждениями и, к концу месяца (я вас уверяю) , вы начнёте ощущать, что достойны большего.`,
        ],
        linkPay: 'https://payform.ru/ec8lia/',
    },
    {
        imgSrc: null,
        nameItem: 'МЕДИТАЦИЯ «ПРЕДНАЗНАЧЕНИЕ»',
        nameItemSub:
            '*Мои медитации не про духовность. Это целенаправленная работа с подсознанием. Внутри каждого из нас, на подсознании , уже есть все ответы : чем я хочу заниматься/в чем я преуспею/что мне принесёт много денег и реализацию',
        coast: '1 555',
        coastStrike: '9 999',
        description: [
            `Но логика очень мешает получить нам эти ответы. Поэтому мы с вами достучимся до истины через медитацию`,
            `Все мои медитации про соединение с собой. Когда начинаешь чувствовать себя и понимать чего ты действительно хочешь , для чего ты рождён и какого уровня достоин. Потому готовьтесь рыдать от счастья , как участники моего марафона Изобилия, которые делали эту медитацию и наконец осознали своё предназначение.`,
            `*ее можно слушать постоянно , каждый раз подгружаясь глубже и глубже, разглядывая все новые и новые детали своего потенциала.`,
        ],
        linkPay: 'https://payform.ru/ef8lid/',
    },
]