export const ArrayContentTypeConsultation = [
    {
        id: '1238',
        imgSrc: null,
        nameItem: 'БИЗНЕС-КОНСУЛЬТАЦИЯ',
        nameItemSub:
        '',
        period: '2 часа',
        coast: '350 000',
        installment: false,
        description: [
            `✔Ваше предназначение, таланты, задачи на жизнь`,
            `✔Мой секрет, как вырасти х10 за год в доходе и работать меньше, чем сейчас`,
            `✔Благоприятная деятельность, ПОДХОДЯЩАЯ ЛИЧНО ВАМ ПО ВСЕМ ПАРАМЕТРАМ, которая принесёт максимум результата при минимуме усилий`,
            `✔Уникальность (в чем ваша главная, природная фишка и отличие от других экспертов/блогеров/бизнесов. Как ее выделить и за счёт этого ВЛЮБЛЯТЬ в себя клиентов, быстрее расти и больше зарабатывать)`,
            `✔Когда благоприятно инвестировать/рисковать/начинать новый проект, а когда/где/с кем стоит быть аккуратнее.`,
            `✔Как избежать негативные, сложные периоды`,
            `✔Разбор здоровья и возможных проблем: -в каких сферах могут возникать -каким подвержены.`,
            `✔Как избежать выгорания лично вам - что вас заряжает и даёт энергию`,
            `✔Как лично вам найти баланс и гармонию между всеми сферами жизни , не стрессуя от того, что нет времени на что-то`,
            `✔Нет ощущения полноценного счастья/удовлетворения от жизни - как быстро решить`,
        ],
        // linkPay: 'https://payform.ru/ec8lia/',
        linkPay: `Я поздравляю тебя с покупкой билета в новую изобильную жизнь! Скоро я свяжусь с тобой.`,
        buttonName: 'Улучшить жизнь',
        toggleLimit: false, //true - button pay will disabled, false - button pay will enabled, false - is default value for all
    },
    {
        id: '1234',
        imgSrc: null,
        nameItem: 'МИНИ-КОНСУЛЬТАЦИЯ',
        nameItemSub:
            '',
        period: '20 минут',
        coast: '9 999',
        installment: false,
        description: [
            `Разбор одной сферы жизни или одного вопроса. Конкретные индивидуальные рекомендации, с получением результата уже в первые 7 дней, при их выполнении.`,
        ],
        // linkPay: 'https://payform.ru/ea8li8/',
        linkPay: `Я поздравляю тебя с покупкой билета в новую изобильную жизнь! Скоро я свяжусь с тобой.`,
        buttonName: 'Улучшить жизнь',
        toggleLimit: true, //true - button pay will disabled, false - button pay will enabled, false - is default value for all
    },
    {
        id: '1235',
        imgSrc: null,
        nameItem: 'ЭКСПРЕСС-КОНСУЛЬТАЦИЯ',
        nameItemSub:
            '',
        period: '1,5 часа',
        coast: '44 444',
        installment: true,
        description: [
            `✔экспресс -подбор предназначения : кто вы, для чего вы рождены, кармические задачи.`,
            `✔Ваша миссия`,
            `✔Разбор 4-5 сфер жизни, их возможные сценарии и индивидуальные конкретные рекомендации по улучшению, с получением результата уже в первые 7 дней`,
            `✔Ваш настоящий потенциал и возможности в жизни`,
            `✔Ваши таланты и скрытые возможности`,
            `✔Наиболее подходящие профессии для заработка`,
            `✔Что выбрать: бизнес/фриланс/найм`,
            `✔Брак: каким будет, когда примерно, где можно встретить любовь`,
            `✔Как улучшить отношения/почему не складываются. Разбор ошибок и рекомендации по устранению`,
            `✔Что ждать в ближайшие периоды, для чего они благоприятны и как не упустить возможности`,
            `✔В случае с "черной полосой": когда закончится, как это ускорить, как уменьшить негатив и повернуть в свою пользу`,
        ],
        // linkPay: 'https://payform.ru/ec8lia/',
        linkPay: `Я поздравляю тебя с покупкой билета в новую изобильную жизнь! Скоро я свяжусь с тобой.`,
        buttonName: 'Улучшить жизнь',
        toggleLimit: false, //true - button pay will disabled, false - button pay will enabled, false - is default value for all
    },
    {
        id: '1236',
        imgSrc: null,
        nameItem: 'БАЗОВАЯ КОНСУЛЬТАЦИЯ',
        nameItemSub:
            '',
        period: '3 часа',
        coast: '89 999',
        installment: true,
        description: [
            `✔Возможные сценарии вашей жизни`,
            `✔Ваши сильные стороны и как их использовать «на полную»`,
            `✔Ваши минусы и слабые стороны. Рекомендации по устранению`,
            `✔Ваши таланты и стремления`,
            `✔В чем ваше предназначение и смысл жизни`,
            `✔Ваша миссия и кармические задачи`,
            `✔Как увеличить ваше финансовое благосостояние. Что его блокирует и как этого избежать.`,
            `✔Наиболее подходящие профессии для заработка`,
            `✔Ваш РЕАЛЬНЫЙ потенциал`,
            `✔Что выбрать: бизнес/фриланс/найм`,
            `✔Ваш идеальный партнёр и как его не упустить`,
            `✔Как привести отношения к лучшему сценарию`,
            `✔Брак: каким будет, когда примерно, где встретитесь`,
            `✔Почему не складываются отношения. Разбор ошибок и рекомендации по устранению`,
            `✔Что ждать в ближайшие периоды. Для чего они благоприятны/не благоприятны. Как не упустить возможности`,
            `✔В случае с «чёрной полосой»: когда закончится и как это ускорить, как уменьшить негатив И повернуть в свою пользу`,
            `➕разбор волнующих вас вопросов`,
        ],
        // linkPay: 'https://payform.ru/ec8lia/',
        linkPay: `Я поздравляю тебя с покупкой билета в новую изобильную жизнь! Скоро я свяжусь с тобой.`,
        buttonName: 'Улучшить жизнь',
        toggleLimit: false, //true - button pay will disabled, false - button pay will enabled, false - is default value for all
    },
    {
        id: '1237',
        imgSrc: null,
        nameItem: 'УГЛУБЛЕННАЯ КОНСУЛЬТАЦИЯ',
        nameItemSub:
            '',
        period: '4 часа (2 встречи по 2ч)',
        coast: '122 222',
        installment: false,
        description: [
            `✔Все, что входит в Базовую консультацию(см.описание выше)`,
            `✔Углубленный разбор вашей личности`,
            `✔БЛАГОПРИЯТНАЯ/НЕ БЛАГОПРИЯТНАЯ ДЕЯТЕЛЬНОСТЬ В ПРОФЕССИИ И В ЖИЗНИ`,
            `✔Углубленный разбор профессиональной деятельности`,
            `✔ПОДБОР ПРОФЕССИИ ПОДХОДЯЩЕЙ ЛИЧНО ВАМ ПО ВСЕМ ПАРАМЕТРАМ`,
            `✔«Зеркало» - как вас воспринимают люди и как это использовать`,
            `✔углубленный разбор Здоровья и возможных проблем:
            -в каких сферах могут возникать -каким подвержены, как избежать`,
        ],
        // linkPay: 'https://payform.ru/ec8lia/',
        linkPay: `Я поздравляю тебя с покупкой билета в новую изобильную жизнь! Скоро я свяжусь с тобой.`,
        buttonName: 'Улучшить жизнь',
        toggleLimit: false, //true - button pay will disabled, false - button pay will enabled, false - is default value for all
    },
    {
        id: '1239',
        imgSrc: null,
        nameItem: 'VIP сопровождение на новый уровень жизни',
        nameItemSub:
            '',
        period: '30 дней',
        coast: '488 888',
        installment: true,
        period2: '90 дней',
        coast2: '999 999',
        installment2: true,
        description: [
            `✔Углубленная консультация (2 астрологические и таро-консультации по 2 часа)`,
            `✔Медитация, раскрывающая ваш настоящий потенциал на эту жизнь и позволяющий его увидеть и почувствовать прямо во время консультации`,
            `✔Наставничество от меня в течении месяца/трёх (на выбор)`,
            `✔Набор камней, подобранных к вашему гороскопу , гармонизируюших и улучшающих финансы, удачу, любовь, карьеру, здоровье`,
            `✔Мощнейший ритуал, выполненный лично мной и улучшающий финансы или личную жизнь (на выбор)`,
            `✔Сильнейшие рунические формулы:
            -увеличение фин.потока
            -удача во всем
            -поток клиентов
            -уверенность в себе, магнетизм
            -переход на новый уровень жизни
            -очищение от фин.блоков, -открытие дорог, увеличение энергии для действий`,
            `🎁 Бонус от меня :
            -медитация «Изобилие» (помогла мне поднять свой доход x2 за месяц)
            -медитация «Предназначение» (за один день 70 человек на моем марафоне осознали своё предназначение через неё)`,
        ],
        // linkPay: 'https://payform.ru/ec8lia/',
        linkPay: `Я поздравляю тебя с покупкой билета в новую изобильную жизнь! Скоро я свяжусь с тобой.`,
        buttonName: 'Мощно и быстро\n улучшить жизнь',
        toggleLimit: false, //true - button pay will disabled, false - button pay will enabled, false - is default value for all
    },
]