// import Item1 from '../../../images/catalog/1.png'

export const ArrayContentTypeStones = [
    {
        imgSrc: null,
        nameItem: 'КАМЕНЬ 1',
        nameItemSub:
            'Руническая программа на быстрые деньги/стабильный доход',
        coast: '777',
        description: [
            `•К вам начинает течь мощнейший поток денег`,
            `•В вашу жизнь приходят полезные люди`,
            `•Вам начинает везти в деньгах`,
            `•Происходят события, создающие постоянный денежный поток`,
            `•Дает активные изменения к лучшему в деньгах и карьере`,
            `•Помогает сдвинуть с места, если есть застой`,
            `•Создаёт круговорот денежных средств: вы тратите, а они возвращаются`,
            `•Дает энергию на заработок`,
            `•Если вы транжира - поможет разумно подойти к процессу трат (а еще ее очень хорошо наносить на банковские счета, чтобы не рисковать деньгами или на кошелек, чтобы обезопасить от кражи и необдуманных трат)`,
        ],
        linkPay: 'https://payform.ru/ea8li8/',
    },
    {
        imgSrc: null,
        nameItem: 'КАМЕНЬ 2',
        nameItemSub:
            'Рунческая программа на поток клиентов «Магнетизм»',
        coast: '777',
        description: [
            `•Разрушает все препятствия на пути клиентов к вам`,
            `•Убирает конкуренцию. Клиент просто не замечает другие услуги`,
            `•Направляет к вам подарки судьбы и просто подарки`,
            `•Увеличивает поток клиентов в ваши проекты/ торговую точку`,
        ],
        linkPay: 'https://payform.ru/ec8lia/',
    },
]