// import Item1 from '../../../images/catalog/1.png'

export const ArrayContentTypeMeditation = [
    {
        id: '4567',
        imgSrc: null,
        nameItem: 'МЕДИТАЦИЯ ИЗОБИЛИЯ',
        nameItemSub:
            'Ловите мою легендарную медитацию Изобилия! Когда я делала её на протяжении 28 дней - я подняла свой уровень дохода в 2 раза!',
        coast: '50',
        description: [
            `Но... я ее обновила и усовершенствовала: теперь там супер-звук и полное погружение✨`,
            `Не удивляйтесь, если во время неё вы будете плакать от счастья - так происходит очень часто, когда вы начинаете ощущать чего достойны НА САМОМ ДЕЛЕ.`,
            `Эта медитация состоит из позитивных установок. В нашей голове очень много ненужных мыслей о себе: "Я - не смелый, не харизматичный, не достойный" и т.д. В этой медитации установки, обратные этим убеждениям. Когда вы постоянно слушаете похвалу от других людей, как бы вы сильно были не уверены в себе - вы начинаете больше верить в себя и любить себя. Эта медитация будет работать точно также.`,
            `Весь негатив в вашей голове сменится позитивными убеждениями и, к концу месяца (я вас уверяю) , вы начнёте ощущать, что достойны большего.`,
        ],
        // linkPay: 'https://payform.ru/ec8lia/',
        // linkPay: `Я поздравляю тебя с покупкой билета в новую изобильную жизнь! По ссылке ты можешь скачать медитацию https://github.com/astrologdemidova/landing/raw/main/runafile22/2hryIjhfk/Поток%20клиентов.pdf`,
        linkPay: `Поздравляю с покупкой билета в новую жизнь! Скачать медитацию https://disk.yandex.ru/d/w_e1bBeYWZyeOw`,
        buttonName: 'Увеличить денежный поток',
    },
    {
        id: '4568',
        imgSrc: null,
        nameItem: 'МЕДИТАЦИЯ «ПРЕДНАЗНАЧЕНИЕ»',
        nameItemSub:
            '',
        coast: '1 555',
        coastStrike: '9 999',
        description: [
            `Она поможет вам услышать свой внутренний голос, понять чем вы хотите заниматься на самом деле и что является вашим делом души, вашим предназначением.`,
            `Вы это очень отчетливо ощутите сами. Ощущение счастья в этот момент невозможно передать словами.`,            
            `*Медитацию можно слушать постоянно , каждый раз погружаясь глубже и глубже, разглядывая все новые и новые детали своего потенциала.`,
        ],
        // linkPay: 'https://payform.ru/ef8lid/',
        // linkPay: `Я поздравляю тебя с покупкой билета в новую изобильную жизнь! По ссылке ты можешь скачать медитацию https://github.com/astrologdemidova/landing/raw/main/runafile22/5Gkhgdfk/Чистка%20фин%20блоков%20.pdf`,
        linkPay: `Поздравляю с покупкой билета в новую жизнь! Скачать медитацию https://disk.yandex.ru/d/RYNelX1eWwSPPg`,
        buttonName: 'Узнать предназначение',
    },
]
