// import Item1 from '../../../images/catalog/1.png'

export const ArrayContentTypeMeditation = [
    {
        imgSrc: null,
        nameItem: 'МЕДИТАЦИЯ ИЗОБИЛИЯ',
        nameItemSub:
            'Рунческая программа на поток клиентов «Магнетизм»',
        coast: '777',
        description: [
            `•Направляет к вам поток людей, которые ищут специалиста, как вы`,
            `•Разрушает все препятствия на пути клиентов к вам`,
            `•Убирает конкуренцию. Клиент просто не замечает другие услуги`,
            `•Создаются все условия, чтобы выбрали именно вас. В разы усиливается ваш магнетизм и людей необъяснимо тянет`,
            `•Люди выбирают именно вас среди конкурентов, вы яркие как солнце, заметные и привлекательные, что глаз не оторвать`,
            `•Даёт достойную оплату ваших услуг. Если у вас цены/зп ниже, чем вы достойны - в жизнь начинают приходить премии/доплаты`,
            `•Направляет к вам подарки судьбы и просто подарки`,
            `•Увеличивает поток клиентов в ваши проекты/ торговую точку`,
        ],
        linkPay: 'https://payform.ru/ec8lia/',
    },
    {
        imgSrc: null,
        nameItem: 'Чистка финансовых блоков',
        nameItemSub:
            'Руническая программа «Динамит»: на чистку внутренних финансовых блоков и негативных установок, мешающих обретению богатства',
        coast: '777',
        description: [
            `•Работает , как молот, который разбивает все блоки, комплексы, страхи, установки, связанные с деньгами`,
            `•Вы начинаете , на уровне чувств, ощущать, что достойны денег и Изобилия`,
            `•Очищает наши негативные мысли на тему денег и того, насколько мы достойны богатства и Изобилия`,
            `•Вычищает страхи, связанные с деньгами из нашего подсознания`,
            `•Улучшает все ассоциации, связанные с деньгами (например установка «богатые - жадные и злые» тормозит нас от того, чтобы быть богатым, а этот рунический став поможет начать смотреть на мир иначе)`,
            `•Напитывает нас энергией, чтобы принять трансформации`,
            `•Дает ощущение радости от жизни, чтобы все было во благо и все изменение приносили удовольствие`,
        ],
        linkPay: 'https://payform.ru/ef8lid/',
    },
]