// import Item1 from '../../../images/catalog/1.png'

export const ArrayContentTypeConsultation = [
    {
        imgSrc: null,
        nameItem: 'КОНСУЛЬТАЦИЯ 1',
        nameItemSub:
            'Руническая программа на быстрые деньги/стабильный доход',
        coast: '777',
        description: [
            `•К вам начинает течь мощнейший поток денег`,
            `•Помогает сдвинуть с места, если есть застой`,
            `•Создаёт круговорот денежных средств: вы тратите, а они возвращаются`,
        ],
        linkPay: 'https://payform.ru/ea8li8/',
    },
    {
        imgSrc: null,
        nameItem: 'ПОТОК КЛИЕНТОВ',
        nameItemSub:
            'Рунческая программа на поток клиентов «Магнетизм»',
        coast: '777',
        description: [
            `•Направляет к вам поток людей, которые ищут специалиста, как вы`,
            `•Разрушает все препятствия на пути клиентов к вам`,
            `•Убирает конкуренцию. Клиент просто не замечает другие услуги`,
            `•Направляет к вам подарки судьбы и просто подарки`,
            `•Увеличивает поток клиентов в ваши проекты/ торговую точку`,
        ],
        linkPay: 'https://payform.ru/ec8lia/',
    },
]